In [1]:
# load packages
import pandas as pd # data manipulation
import matplotlib.pyplot as plt # visualisation
import seaborn as sns

## 1.1 Load Data

In [2]:
# read csv file
train = pd.read_csv('train.csv')

In [3]:
# inspect data
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [4]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [5]:
train.describe(include='all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Gilnagh, Miss. Katherine ""Katie""",male,NaN,NaN,NaN,347082,NaN,C23 C25 C27,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

## 1.2 Clean Data

In [6]:
# drop columns with >40% null values

null_col = list(train.columns[train.isnull().sum() > len(train)*0.4])
train.drop(null_col, axis=1, inplace=True)

In [7]:
# drop passengerid and name column
train.drop(['PassengerId', 'Name'], axis=1, inplace=True)

In [8]:
# fill null values in age with mean
train['Age'].fillna(train['Age'].mean(), inplace=True)

# fill null values in embarked with mode
train['Embarked'].fillna(train['Embarked'].mode()[0], inplace=True)

In [9]:
# check train
train.describe(include='all')

,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
count,891.000000,891.000000,891,891.000000,891.000000,891.000000,891,891.000000,891
unique,NaN,NaN,2,NaN,NaN,NaN,681,NaN,3
top,NaN,NaN,male,NaN,NaN,NaN,347082,NaN,S
freq,NaN,NaN,577,NaN,NaN,NaN,7,NaN,646
mean,0.383838,2.308642,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN
std,0.486592,0.836071,NaN,13.002015,1.102743,0.806057,NaN,49.693429,NaN
min,0.000000,1.000000,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN
25%,0.000000,2.000000,NaN,22.000000,0.000000,0.000000,NaN,7.910400,NaN
50%,0.000000,3.000000,NaN,29.699118,0.000000,0.000000,NaN,14.454200,NaN
75%,1.000000,3.000000,NaN,35.000000,1.000000,0.000000,NaN,31.000000,NaN
max,1.000000,3.000000,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN

In [10]:
# get dummies for sex

# get dummies for embarked

In [11]:
# sns.pairplot(train)